In [1]:
# Pandas

import pandas as pd

# DataFrame létrehozás:

data = {
    'alma': [10, 20, 30],
    'körte': ['x', 'y', 'z']

}

df1 = pd.DataFrame(data)

df1

   alma körte
0    10     x
1    20     y
2    30     z

In [2]:
df1.describe()

       alma
count   3.0
mean   20.0
std    10.0
min    10.0
25%    15.0
50%    20.0
75%    25.0
max    30.0

In [6]:
data = [
    {'a': 10, 'b': 2.5, 'c': 'Józsi'},
    {'a': 20, 'c': 'Gábor'},
    {'a': 30, 'b': 5.5, 'c': 'Károly'},
]

df2 = pd.DataFrame(data)

df2

    a    b       c
0  10  2.5   Józsi
1  20  NaN   Gábor
2  30  5.5  Károly

In [5]:
df3 = pd.DataFrame(data, index=['sör', 'bor', "pálinka"])
df3

          a    b       c
sör      10  2.5   Józsi
bor      20  NaN   Gábor
pálinka  30  5.5  Károly

In [8]:
df1[['alma']]

   alma
0    10
1    20
2    30

In [9]:
df = pd.DataFrame([
    {'tanuló': 'Gipsz Jakab',  'tantárgy': 'Matematika',  'osztályzat': 5},
    {'tanuló': 'Gipsz Jakab',  'tantárgy': 'Testnevelés', 'osztályzat': 2},
    {'tanuló': 'Bank Aranka',  'tantárgy': 'Matematika',  'osztályzat': 3},
    {'tanuló': 'Bank Aranka',  'tantárgy': 'Matematika',  'osztályzat': 5},
    {'tanuló': 'Bank Aranka',  'tantárgy': 'Testnevelés', 'osztályzat': 4},
    {'tanuló': 'Rontó Róbert', 'tantárgy': 'Matematika',  'osztályzat': 1},
    {'tanuló': 'Rontó Róbert', 'tantárgy': 'Matematika',  'osztályzat': 2},
    {'tanuló': 'Rontó Róbert', 'tantárgy': 'Testnevelés', 'osztályzat': 5},
])
df

df['tanuló'] == 'Gipsz Jakab'

0     True
1     True
2    False
3    False
4    False
5    False
6    False
7    False
Name: tanuló, dtype: bool

In [10]:
df[df['tanuló'] == 'Gipsz Jakab'] # első df = DataFrame, második df = Maga az oszlop

        tanuló     tantárgy  osztályzat
0  Gipsz Jakab   Matematika           5
1  Gipsz Jakab  Testnevelés           2

In [11]:
df[(df['osztályzat'] < 5) & (df['osztályzat'] > 1)]

         tanuló     tantárgy  osztályzat
1   Gipsz Jakab  Testnevelés           2
2   Bank Aranka   Matematika           3
4   Bank Aranka  Testnevelés           4
6  Rontó Róbert   Matematika           2

In [13]:
data = [
    {'a': 10, 'b': 2.5, 'c': 'Józsi'},
    {'a': 20, 'c': 'Géza'},
    {'a': 30, 'b': 5.5, 'c': 'Károly'}
]
df2 = pd.DataFrame(data, index=['sör', 'bor', 'pálinka'])
df2

          a    b       c
sör      10  2.5   Józsi
bor      20  NaN    Géza
pálinka  30  5.5  Károly

In [14]:
df2.loc[['sör', 'pálinka']]

          a    b       c
sör      10  2.5   Józsi
pálinka  30  5.5  Károly

In [15]:
df2.iloc[[0, 2]] # pozició alapján kiválasztás

          a    b       c
sör      10  2.5   Józsi
pálinka  30  5.5  Károly

In [16]:
se2 = pd.Series([42, 43, 44], index=['a', 'b', 'c'])
se2

a    42
b    43
c    44
dtype: int64

In [17]:
df

         tanuló     tantárgy  osztályzat
0   Gipsz Jakab   Matematika           5
1   Gipsz Jakab  Testnevelés           2
2   Bank Aranka   Matematika           3
3   Bank Aranka   Matematika           5
4   Bank Aranka  Testnevelés           4
5  Rontó Róbert   Matematika           1
6  Rontó Róbert   Matematika           2
7  Rontó Róbert  Testnevelés           5

In [22]:
df.groupby('tantárgy').size()

tantárgy
Matematika     5
Testnevelés    3
dtype: int64

In [21]:
df.groupby('tantárgy').mean() # Átlag

TypeError: 'DataFrameGroupBy' object is not callable